tap "homebrew/bundle"
tap "timescale/tap"

# Core Tools
brew "git"
cask "alacritty"  # Mostly for OSC 52.
brew "tmux"
brew "vim"
brew "neovim"
brew "zsh"

# Misc
brew "bash"
brew "gh"
brew "glab"
brew "align"
brew "htop"
brew "mysql-client", link: true
brew "sqlite"
brew "wget"

# Language Tools
brew "perl"
brew "yarn"

# Ruby Projects
brew "anycable-go"
brew "freetds"
brew "graphviz"
brew "openssl"
brew "redis"
brew "rrdtool"
brew "shared-mime-info"
brew "timescaledb"
brew "zlib"
